// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.


//
// example 1
//
// let num = Number(prompt("Введіть значення"));
// let result;

// switch (num) {
//   case 1:
//     result = "зима";
//     break;
//   case 2:
//     result = "весна";
//     break;
//   case 3:
//     result = "літо";
//     break;
//   case 4:
//     result = "осінь";
//     break;
//   default:
//     result = "Вибачте, але Ви маєте ввести значення від 1 до 4 включно";
// }

// alert(result);

//
// example 2
//
function season(num) {
  const seasons = ["зима", "весна", "літо", "осінь", "Вибачте, але Ви маєте ввести значення від 1 до 4 включно"];  
  return num && num >= 1 && num <=4 ? seasons[num-1] : seasons[4] 
}

alert(`Сезон ${season(prompt(`Введіть номер сезону`))}`);